# SetSpec Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FieldBuilder..::..SetSpec Method
FieldBuilder Class See Also
---
Sets the spec describing the field's values.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public FieldBuilder SetSpec(
	ForgeTypeId specTypeId
)
```

Visual Basic
---
```text
Public Function SetSpec ( _
	specTypeId As ForgeTypeId _
) As FieldBuilder
```

Visual C++
---
```text
public:
FieldBuilder^ SetSpec(
	ForgeTypeId^ specTypeId
)
```

# ### Parameters
specTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId Identifier of the spec.
# ### Return Value
The FieldBuilder object may be used to add more details to the field.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The SchemaBuilder has already finished building the Schema. -or- The field type does not utilize unit conversions. |

# See Also
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace